In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('2nd-degree_2018-05-04_1535.csv')
df.head()

,A_id,B_id,A_name,B_name,active
0,100003776767390,100004648242525,Josue Montero Banegas,Lucy Ortiz,1
1,100003776767390,100003693200009,Josue Montero Banegas,Decanato Facultad De Ingeniera Universidad De ...,1
2,100003776767390,100002756209020,Josue Montero Banegas,ByRn BrrEt,1
3,100003776767390,100003172620047,Josue Montero Banegas,Daya Pacheco,1
4,100003776767390,100002471486062,Josue Montero Banegas,Christian Godoy,1

In [4]:
df.shape

(29442, 5)

In [13]:
df[['A_name', 'B_id']].groupby('A_name', axis=0).count().sort_values('B_id', ascending=False).reset_index().to_csv('summanry-2nd-degree-seeds.csv')

In [2]:
files = ['2nd-degree_2018-04-22_1242.csv', '2nd-degree_2018-04-22_1512.csv', '2nd-degree_2018-04-22_2110.csv']

In [3]:
df = pd.read_csv(files[0])
df.head()

        A_id             B_id       A_name                 B_name  active
0  528048242        715779096  Juan Felipe   Alvaro Neira Azqueta       1
1  528048242        675603732  Juan Felipe        Andres Monsalve       1
2  528048242  100009661262012  Juan Felipe             Cari Tobar       1
3  528048242  100002550124458  Juan Felipe  Caty Carrion Valarezo       1
4  528048242        615605502  Juan Felipe       Daniela Monsalve       1

In [4]:
df.shape

(34044, 5)

In [11]:
df.drop_duplicates(['B_id']).shape

(23259, 5)

In [5]:
df_1 = pd.read_csv(files[1])
df_1.head()

         A_id             B_id         A_name            B_name  active
0  1507307063        730047153  Mnica Cabrera  Marcos G Fuentes       1
1  1507307063        745246356  Mnica Cabrera       Gabriela LC       1
2  1507307063        527323025  Mnica Cabrera      Pablo Medina       1
3  1507307063  100001618892544  Mnica Cabrera        Gaby Onate       1
4  1507307063         11608627  Mnica Cabrera     Mario Hidalgo       1

In [6]:
df_1.shape

(110942, 5)

In [12]:
df_1.drop_duplicates(['B_id']).shape

(71304, 5)

In [7]:
df_2 = pd.read_csv(files[2])
df_2.head()

,A_id,B_id,A_name,B_name,active
0,100000934646354,1394970130,Mayra Paola Mndez,Andrea Guevara,1
1,100000934646354,754303807,Mayra Paola Mndez,Dani Barrera,1
2,100000934646354,549864809,Mayra Paola Mndez,Fernanda ChicaPesntez,1
3,100000934646354,100000141469042,Mayra Paola Mndez,Fernando Baculima,1
4,100000934646354,100001941468654,Mayra Paola Mndez,Kary Abad R,1

In [8]:
df_2.shape

(8055, 5)

In [13]:
df_2.drop_duplicates(['B_id']).shape

(7665, 5)

In [10]:
df.shape[0] + df_1.shape[0] + df_2.shape[0]

153041

In [14]:
df.drop_duplicates(['B_id'], inplace=True)
df_1.drop_duplicates(['B_id'], inplace=True)
df_2.drop_duplicates(['B_id'], inplace=True)
df.shape[0] + df_1.shape[0] + df_2.shape[0]

102228

In [15]:
df_all = df.append(df_1).append(df_2)

(23259, 5)

In [16]:
df_all.shape

(102228, 5)

In [19]:
df_all.drop_duplicates(['B_id'], inplace=True)

In [20]:
df_all.shape

(88133, 5)

In [21]:
df_all.columns

Index(['A_id', 'B_id', 'A_name', 'B_name', 'active'], dtype='object')

In [22]:
df_all.to_csv('for-3rd-degree.csv', index=False)